bench/proxysql.log
sysbench 1.0.20 (using system LuaJIT 2.0.5)

Running the test with following options:
Number of threads: 3
Report intermediate results every 5 second(s)
Initializing random number generator from current time

Forcing shutdown in 301 seconds

Initializing worker threads...

Threads started!

[ 5s ] thds: 3 tps: 422.65 qps: 12257.78 (r/w/o: 12257.78/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 3 tps: 423.61 qps: 12288.75 (r/w/o: 12288.75/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 3 tps: 416.63 qps: 12086.03 (r/w/o: 12086.03/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 3 tps: 414.78 qps: 12027.56 (r/w/o: 12027.56/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 3 tps: 435.61 qps: 12635.59 (r/w/o: 12635.59/0.00/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 3 tps: 412.19 qps: 11949.34 (r/w/o: 11949.34/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 3 tps: 423.59 qps: 12288.97 (r/w/o: 12288.97/0.00/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 3 tps: 446.18 qps: 12939.94 (r/w/o: 12939.94/0.00/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 3 tps: 445.84 qps: 12922.28 (r/w/o: 12922.28/0.00/0.00) lat (ms,95%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 3 tps: 431.40 qps: 12519.20 (r/w/o: 12519.20/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 3 tps: 445.39 qps: 12908.24 (r/w/o: 12908.24/0.00/0.00) lat (ms,95%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 3 tps: 439.40 qps: 12738.53 (r/w/o: 12738.53/0.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 3 tps: 383.40 qps: 11127.39 (r/w/o: 11127.39/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 3 tps: 414.00 qps: 12007.27 (r/w/o: 12007.27/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 3 tps: 417.41 qps: 12104.80 (r/w/o: 12104.80/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 3 tps: 367.99 qps: 10668.65 (r/w/o: 10668.65/0.00/0.00) lat (ms,95%): 11.87 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 3 tps: 402.82 qps: 11681.87 (r/w/o: 11681.87/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 3 tps: 407.38 qps: 11813.91 (r/w/o: 11813.91/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 3 tps: 427.80 qps: 12404.91 (r/w/o: 12404.91/0.00/0.00) lat (ms,95%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 3 tps: 411.40 qps: 11933.33 (r/w/o: 11933.33/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 3 tps: 418.38 qps: 12134.63 (r/w/o: 12134.63/0.00/0.00) lat (ms,95%): 9.22 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 3 tps: 416.00 qps: 12061.13 (r/w/o: 12061.13/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 3 tps: 395.61 qps: 11471.77 (r/w/o: 11471.77/0.00/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 3 tps: 414.82 qps: 12035.45 (r/w/o: 12035.45/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 3 tps: 401.37 qps: 11639.44 (r/w/o: 11639.44/0.00/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 3 tps: 392.82 qps: 11391.73 (r/w/o: 11391.73/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 3 tps: 407.19 qps: 11807.27 (r/w/o: 11807.27/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 3 tps: 398.00 qps: 11540.28 (r/w/o: 11540.28/0.00/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 3 tps: 387.58 qps: 11238.40 (r/w/o: 11238.40/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 3 tps: 403.00 qps: 11682.19 (r/w/o: 11682.19/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 3 tps: 398.82 qps: 11573.00 (r/w/o: 11573.00/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 3 tps: 406.00 qps: 11769.74 (r/w/o: 11769.74/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 3 tps: 400.18 qps: 11612.36 (r/w/o: 11612.36/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 3 tps: 382.42 qps: 11086.90 (r/w/o: 11086.90/0.00/0.00) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 3 tps: 406.79 qps: 11797.26 (r/w/o: 11797.26/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 3 tps: 406.01 qps: 11772.55 (r/w/o: 11772.55/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 3 tps: 390.00 qps: 11314.51 (r/w/o: 11314.51/0.00/0.00) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 3 tps: 397.79 qps: 11527.01 (r/w/o: 11527.01/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 3 tps: 406.39 qps: 11787.65 (r/w/o: 11787.65/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 3 tps: 419.21 qps: 12155.70 (r/w/o: 12155.70/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 3 tps: 424.60 qps: 12318.36 (r/w/o: 12318.36/0.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 3 tps: 398.99 qps: 11570.99 (r/w/o: 11570.99/0.00/0.00) lat (ms,95%): 9.73 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 3 tps: 410.41 qps: 11895.25 (r/w/o: 11895.25/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 3 tps: 402.59 qps: 11684.27 (r/w/o: 11684.27/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 3 tps: 391.20 qps: 11339.32 (r/w/o: 11339.32/0.00/0.00) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 3 tps: 375.19 qps: 10879.43 (r/w/o: 10879.43/0.00/0.00) lat (ms,95%): 10.65 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 3 tps: 394.82 qps: 11451.77 (r/w/o: 11451.77/0.00/0.00) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 3 tps: 410.80 qps: 11914.68 (r/w/o: 11914.68/0.00/0.00) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 3 tps: 421.21 qps: 12214.05 (r/w/o: 12214.05/0.00/0.00) lat (ms,95%): 9.06 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 3 tps: 417.98 qps: 12123.39 (r/w/o: 12123.39/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 3 tps: 418.59 qps: 12140.01 (r/w/o: 12140.01/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 3 tps: 410.63 qps: 11906.13 (r/w/o: 11906.13/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 3 tps: 428.21 qps: 12418.97 (r/w/o: 12418.97/0.00/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 3 tps: 425.96 qps: 12350.69 (r/w/o: 12350.69/0.00/0.00) lat (ms,95%): 8.90 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 3 tps: 401.82 qps: 11652.70 (r/w/o: 11652.70/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 3 tps: 425.40 qps: 12339.65 (r/w/o: 12339.65/0.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 3 tps: 429.20 qps: 12448.51 (r/w/o: 12448.51/0.00/0.00) lat (ms,95%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 3 tps: 412.39 qps: 11957.12 (r/w/o: 11957.12/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 3 tps: 420.81 qps: 12199.40 (r/w/o: 12199.40/0.00/0.00) lat (ms,95%): 9.39 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 3 tps: 402.99 qps: 11689.24 (r/w/o: 11689.24/0.00/0.00) lat (ms,95%): 9.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            3576048
        write:                           0
        other:                           0
        total:                           3576048
    transactions:                        123312 (411.03 per sec.)
    queries:                             3576048 (11919.85 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0063s
    total number of events:              123312

Latency (ms):
         min:                                    4.07
         avg:                                    7.30
         max:                                   35.16
         95th percentile:                        9.56
         sum:                               899794.15

Threads fairness:
    events (avg/stddev):           41104.0000/16.97
    execution time (avg/stddev):   299.9314/0.00